## gateway-dev
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.digitalocean_database_cluster.postgres_cluster: Reading...
module.gateway_core_app.data.digitalocean_vpc.vpc: Reading...
module.gateway_core_app.data.digitalocean_vpc.vpc: Read complete after 0s [id=3211d653-f396-45e5-901b-6bf48416c42f]
data.digitalocean_database_cluster.postgres_cluster: Read complete after 1s [id=ffb6569a-8d36-49de-ac45-546857b99bf9]
data.digitalocean_database_user.database_user: Reading...
data.digitalocean_database_user.database_user: Read complete after 0s [id=ffb6569a-8d36-49de-ac45-546857b99bf9/user/gateway_user_fra1_dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gateway_core_app.digitalocean_app.app_service will be created
  + resource "digitalocean_app" "app_service" {
      + active_deployment_id = (known after apply)
      + created_at           = (known after apply)
      + default_ingress      = (known after apply)
      + deployment_per_page  = 20
      + id                   = (known after apply)
      + live_domain          = (known after apply)
      + live_url             = (known after apply)
      + project_id           = "5d792a15-cf5f-46c7-ab46-425f64c52ea4"
      + updated_at           = (known after apply)
      + urn                  = (known after apply)

      + dedicated_ips (known after apply)

      + spec {
          + disable_edge_cache              = false
          + disable_email_obfuscation       = false
          + domains                         = (known after apply)
          + enhanced_threat_control_enabled = false
          + features                        = (known after apply)
          + name                            = "gateway-core-fra1-dev"
          + region                          = "fra1"

          + domain (known after apply)

          + ingress (known after apply)

          + service {
              + http_port          = (known after apply)
              + instance_count     = 1
              + instance_size_slug = "apps-s-1vcpu-1gb"
              + internal_ports     = (known after apply)
              + name               = "gateway-core-service-fra1-dev"
              + run_command        = (known after apply)

              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }

              + health_check {
                  + http_path             = "/liveness"
                  + initial_delay_seconds = 5
                  + period_seconds        = 10
                  + port                  = 8081
                }

              + image {
                  + registry_type = "DOCR"
                  + repository    = "gateway-core"
                  + tag           = "pr-169-0c9ff9d"

                  + deploy_on_push (known after apply)
                }

              + routes (known after apply)
            }

          + vpc {
              + id = "3211d653-f396-45e5-901b-6bf48416c42f"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>